#Вывести на экран текст Silence is golden.

print ("Silence is golden")
