#Вывести на экран n единиц, затем 2n двоек, затем 3n троек. Число n вводит пользователь.

n = int(input("n:"))
print ("1" * n)
print ("2" * n)
print ("3" * n)
