#Выведите на экран строки вида:
#*******
#****
#*******
#****
#*******
#****
n = int(input("n:"))
i=0
while i < n:
    i += 1
    print("*"*7)
    print("*"*4)

