#Пользователь вводит два числа. Найдите сумму и произведение данных чисел.
a = int(input("a:"))
b = int(input("b:"))
print(a+b)
print(a*b)
