#Пользователь вводит число. Выведите на экран квадрат этого числа, куб этого числа.

a = int(input("a="))

print( " ", a**2,'\n ',a**3)

