#Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.

a = int(input("a:"))

p= 4 * a
s= a ** 2
print("p:",p,'\t','s:',s)
