#Вывести на экран текущее название дня недели, название месяца и свое имя. Каждое слово должно быть в отдельной строке
print("Wednesday\nFebruary\nYevgen\n")
