#Вывести на экран пять строк из нулей, причем количество нулей в каждой строке равно номеру строки.
print("0\n00\n000\n0000\n00000")

