#Дано число a. Не пользуясь никакими арифметическими
# операциями кроме умножения, получите
# а)a**4 за две операции;
# б) a**6 за три операции;
# в) a**15 за пять операций.

a = 3

z = a * a * a * a#4
x = z * a * a#6
c = x * x * a * a * a#15

print(z,x,c)


