#Дан прямоугольник размером 647 x 170.
# Сколько квадратов со стороной 30 можно вырезать из него?
a = 647
b = 170

c = 30

print ((a+b)//c)
