#Дано число. Если оно больше 3, то увеличить число на 10,
# иначе уменьшить на 10.

x = int(input("x:"))

if x > 3:
    print(x+10)
else:
    print(x-10)
