#Вывести на экран прямоугольник, заполненный буквами А. Количество строк в прямоугольнике равно 5, количество столбцов равно 8.
for i in range(1,9):
    print("AAAAAA")
