#Вывести на экран букву "W" из символов "*"
print('''
 *     *     *
  *   * *   *
   * *   * *
    *     *
''')
