#Вывести на экран результат вычисления 1+2−4.
print(1+2-4)
