#Выведите на экран 10 раз фразу "You are welcome!"
for i in range (0,10):
    print("You are welcome")
