#Выведите на экран n раз фразу "Silence is golden". Число n вводит пользователь

n = int(input('n:'))
i = 0
while i < n:
    i = i + 1
    print("Silence is golden")
