#Выведите на экран прямоугольник из нулей. Количество строк вводит пользователь, количество столбцов равно 5.

b = int(input("b:"))

for i in range(0,5):
    print("0"* b)

