#Вывести на экран фигуру из звездочек:
#*******
#*******
#*******
#*******
#(квадрат из n строк, в каждой строке n звездочек)

n = int(input("n:"))

for i in range (0,n):
    print("*"*n)
