#Вывести на экран ряд чисел 1001,  1004,  1007,  ... 1025.

for i in range (1001, 1025, 3):
    print(i)
