#Вывести на экран числа 100, 96, 92, ... до последнего положительного включительно.
i= 104
while i > 0:
    i -= 4
    print(i)
