#Выведите на экран числа 1.2, 1.4, 1.6, ..., 2.8

i = float (1)

while i < 3:
    i += 0.2
    print("%.1f" % i )
