#Выведите следующие строки. Первая: 25  25.5  24.8. Вторая: 26 26.5 25.8.  И так далее. Последняя строка: 35 35.5 34.8.


i = 10
num = 25.0
while i >= 0:
    print('%d'%num, end=" ")
    num += 0.5
    print(num, end=" ")
    num -= 0.7
    print(num)
    num += 1.2
    i -= 1
