#Вычислите |x|+x**5, если x=−2.
import math
x = -2
print (math.fabs(x) + x ** 5)
