#Найдите сумму квадратов первых n натуральных чисел
i = 0
sqrtt = 0
n = int(input("n:"))
while i < n:
    i+=1
    sqrtt += i * i
print(sqrtt)
#1+4+9=14
